ZigEmbeddedGroup/microzig/port/nxp/mcx/src/chips/MCXA153.svd
        <register>
          <name>IMR</name>
          <description>Input Monitor Register</description>
          <addressOffset>0x3C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>HOME_ENABLE</name>
              <description>HOME_ENABLE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INDEX_PRESET</name>
              <description>INDEX_PRESET</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PHB</name>
              <description>PHB</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PHA</name>
              <description>PHA</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FHOM_ENA</name>
              <description>filter operation on HOME/ENABLE input</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FIND_PRE</name>
              <description>filter operation on INDEX/PRESET input</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPHB</name>
              <description>filter operation on PHASEB input</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPHA</name>
              <description>filter operation on PHASEA input</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPF0</name>
              <description>Position Compare 0 Flag Output</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CMPF00</name>
                  <description>When the position counter is less than value of COMP0 register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMPF01</name>
                  <description>When the position counter is greater or equal than value of COMP0 register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMP1F</name>
              <description>Position Compare1 Flag Output</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CMP1F0</name>
                  <description>When the position counter is less than value of COMP1 register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMP1F1</name>
                  <description>When the position counter is greater or equal than value of COMP1 register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMP2F</name>
              <description>Position Compare2 Flag Output</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CMP2F0</name>
                  <description>When the position counter is less than value of COMP2 register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMP2F1</name>
                  <description>When the position counter is greater or equal than value of COMP2 register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMP3F</name>
              <description>Position Compare3 Flag Output</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CMP3F0</name>
                  <description>When the position counter value is less than value of COMP3 register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMP3F1</name>
                  <description>When the position counter is greater or equal than value of COMP3 register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIRH</name>
              <description>Count Direction Flag Hold</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIR</name>
              <description>Count Direction Flag Output</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIR0</name>
                  <description>Current count was in the down direction</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIR1</name>
                  <description>Current count was in the up direction</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TST</name>
          <description>Test Register</description>
          <addressOffset>0x3E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>TEST_COUNT</name>
              <description>TEST_COUNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEST_PERIOD</name>
              <description>TEST_PERIOD</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>QDN</name>
              <description>Quadrature Decoder Negative Signal</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QDN0</name>
                  <description>Generates a positive quadrature decoder signal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QDN1</name>
                  <description>Generates a negative quadrature decoder signal</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TCE</name>
              <description>Test Counter Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TCE0</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCE1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEN</name>
              <description>Test Mode Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TEN0</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEN1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UVERID</name>
          <description>Upper VERID</description>
          <addressOffset>0x50</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>UVERID</name>
              <description>UVERID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LVERID</name>
          <description>Lower VERID</description>
          <addressOffset>0x52</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>LVERID</name>
              <description>LVERID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
