ZigEmbeddedGroup/microzig/port/nxp/mcx/src/chips/MCXA153.svd
        <register>
          <name>CMDH7</name>
          <description>Command High Buffer Register</description>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMPEN</name>
              <description>Compare Function Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED_ALWAYS_STORE_RESULT</name>
                  <description>Compare disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPARE_RESULT_STORE_IF_TRUE</name>
                  <description>Compare enabled. Store on true.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPARE_RESULT_KEEP_CONVERTING_UNTIL_TRUE_STORE_IF_TRUE</name>
                  <description>Compare enabled. Repeat channel acquisition (sample/convert/compare) until true.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WAIT_TRIG</name>
              <description>Wait for Trigger Assertion before Execution.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>This command will be automatically executed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>The active trigger must be asserted again before executing this command.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LWI</name>
              <description>Loop with Increment</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Auto channel increment disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Auto channel increment enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STS</name>
              <description>Sample Time Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SAMPLE_3p5</name>
                  <description>Minimum sample time of 3.5 ADCK cycles.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_5p5</name>
                  <description>3.5 + 21 ADCK cycles; 5.5 ADCK cycles total sample time.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_7p5</name>
                  <description>3.5 + 22 ADCK cycles; 7.5 ADCK cycles total sample time.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_11p5</name>
                  <description>3.5 + 23 ADCK cycles; 11.5 ADCK cycles total sample time.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_19p5</name>
                  <description>3.5 + 24 ADCK cycles; 19.5 ADCK cycles total sample time.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_35p5</name>
                  <description>3.5 + 25 ADCK cycles; 35.5 ADCK cycles total sample time.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_67p5</name>
                  <description>3.5 + 26 ADCK cycles; 67.5 ADCK cycles total sample time.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_131p5</name>
                  <description>3.5 + 27 ADCK cycles; 131.5 ADCK cycles total sample time.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AVGS</name>
              <description>Hardware Average Select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_AVERAGE</name>
                  <description>Single conversion.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVERAGE_2</name>
                  <description>2 conversions averaged.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVERAGE_4</name>
                  <description>4 conversions averaged.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVERAGE_8</name>
                  <description>8 conversions averaged.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVERAGE_16</name>
                  <description>16 conversions averaged.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVERAGE_32</name>
                  <description>32 conversions averaged.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVERAGE_64</name>
                  <description>64 conversions averaged.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVERAGE_128</name>
                  <description>128 conversions averaged.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVERAGE_256</name>
                  <description>256 conversions averaged.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVERAGE_512</name>
                  <description>512 conversions averaged.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVERAGE_1024</name>
                  <description>1024 conversions averaged.</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOOP</name>
              <description>Loop Count Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CMD_EXEC_1x</name>
                  <description>Looping not enabled. Command executes 1 time.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD_EXEC_2x</name>
                  <description>Loop 1 time. Command executes 2 times.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD_EXEC_3x</name>
                  <description>Loop 2 times. Command executes 3 times.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD_EXECUTES_CORRESPONDING_TIMES_3</name>
                  <description>Loop corresponding number of times. Command executes LOOP+1 times.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD_EXECUTES_CORRESPONDING_TIMES_4</name>
                  <description>Loop corresponding number of times. Command executes LOOP+1 times.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD_EXECUTES_CORRESPONDING_TIMES_5</name>
                  <description>Loop corresponding number of times. Command executes LOOP+1 times.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD_EXECUTES_CORRESPONDING_TIMES_6</name>
                  <description>Loop corresponding number of times. Command executes LOOP+1 times.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD_EXECUTES_CORRESPONDING_TIMES_7</name>
                  <description>Loop corresponding number of times. Command executes LOOP+1 times.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD_EXECUTES_CORRESPONDING_TIMES_8</name>
                  <description>Loop corresponding number of times. Command executes LOOP+1 times.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD_EXECUTES_CORRESPONDING_TIMES_9</name>
                  <description>Loop corresponding number of times. Command executes LOOP+1 times.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD_EXEC_15x</name>
                  <description>Loop 15 times. Command executes 16 times.</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NEXT</name>
              <description>Next Command Select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_NEXT_CMD_TERMINATE_ON_FINISH</name>
                  <description>No next command defined. Terminate conversions at completion of current command. If lower priority trigger pending, begin command associated with lower priority trigger.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DO_CMD1_NEXT</name>
                  <description>Select CMD1 command buffer register as next command.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DO_CORRESPONDING_CMD_NEXT_2</name>
                  <description>Select corresponding CMD command buffer register as next command</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DO_CORRESPONDING_CMD_NEXT_3</name>
                  <description>Select corresponding CMD command buffer register as next command</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DO_CORRESPONDING_CMD_NEXT_4</name>
                  <description>Select corresponding CMD command buffer register as next command</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DO_CORRESPONDING_CMD_NEXT_5</name>
                  <description>Select corresponding CMD command buffer register as next command</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DO_CORRESPONDING_CMD_NEXT_6</name>
                  <description>Select corresponding CMD command buffer register as next command</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DO_CMD7_NEXT</name>
                  <description>Select CMD7 command buffer register as next command.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>15</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>1,2,3,4,5,6,7,8,9,10,11,12,13,14,15</dimIndex>
          <name>CV%s</name>
          <description>Compare Value Register</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CVL</name>
              <description>Compare Value Low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CVH</name>
              <description>Compare Value High</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RESFIFO0</name>
          <description>Data Result FIFO Register</description>
          <addressOffset>0x300</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>D</name>
              <description>Data Result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TSRC</name>
              <description>Trigger Source</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIGGER_0</name>
                  <description>Trigger source 0 initiated this conversion.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER_1</name>
                  <description>Trigger source 1 initiated this conversion.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_TRIGGER_2</name>
                  <description>Corresponding trigger source initiated this conversion.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER_3</name>
                  <description>Trigger source 3 initiated this conversion.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOOPCNT</name>
              <description>Loop Count Value</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESULT_1</name>
                  <description>Result is from initial conversion in command.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESULT_2</name>
                  <description>Result is from second conversion in command.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_RESULT_2</name>
                  <description>Result is from LOOPCNT+1 conversion in command.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_RESULT_3</name>
                  <description>Result is from LOOPCNT+1 conversion in command.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_RESULT_4</name>
                  <description>Result is from LOOPCNT+1 conversion in command.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_RESULT_5</name>
                  <description>Result is from LOOPCNT+1 conversion in command.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_RESULT_6</name>
                  <description>Result is from LOOPCNT+1 conversion in command.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_RESULT_7</name>
                  <description>Result is from LOOPCNT+1 conversion in command.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_RESULT_8</name>
                  <description>Result is from LOOPCNT+1 conversion in command.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_RESULT_9</name>
                  <description>Result is from LOOPCNT+1 conversion in command.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESULT_16</name>
                  <description>Result is from 16th conversion in command.</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMDSRC</name>
              <description>Command Buffer Source</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_VALID</name>
                  <description>Not a valid value CMDSRC value for a dataword in RESFIFO. 0x0 is only found in initial FIFO state prior to an ADC conversion result dataword being stored to a RESFIFO buffer.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD1</name>
                  <description>CMD1 buffer used as control settings for this conversion.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_CMD_2</name>
                  <description>Corresponding command buffer used as control settings for this conversion.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_CMD_3</name>
                  <description>Corresponding command buffer used as control settings for this conversion.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_CMD_4</name>
                  <description>Corresponding command buffer used as control settings for this conversion.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_CMD_5</name>
                  <description>Corresponding command buffer used as control settings for this conversion.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_CMD_6</name>
                  <description>Corresponding command buffer used as control settings for this conversion.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD7</name>
                  <description>CMD7 buffer used as control settings for this conversion.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VALID</name>
              <description>FIFO Entry is Valid</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_VALID</name>
                  <description>FIFO is empty. Discard any read from RESFIFO.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>FIFO record read from RESFIFO is valid.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>33</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CAL_GAR[%s]</name>
          <description>Calibration General A-Side Registers</description>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CAL_GAR_VAL</name>
              <description>Calibration General A Side Register Element</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
